GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/m66.c
/*
   if( tick - sms_tick > RT_TICK_PER_SECOND * 10 )
   {
   rt_kprintf( "\n靠,超时了" );
   sms_state = SMS_IDLE;
   }
 */
	return sms_state;
}

/*发送短信息,包含接收方,SMSC,7bit编码后的信息*/
void sms_tx( char* info, uint8_t tp_len )
{
	uint8_t len = strlen( info );
	char	*p;
	p = rt_malloc( len + 2 );
	if( p != RT_NULL )
	{
		p[0] = tp_len; /*tp_len AT+CMGS时需要*/
		strcpy( p + 1, info );
		rt_mb_send( &mb_sms, (uint32_t)p );
	}
}

/*
   增加这个函数主要是中心有多个消息过来时候，如果处理不及时，会乱
   使用mailbox进行排队处理读取或删除短信
 */
void sms_proc( void )
{
	uint32_t	i;
	char		*sms_send;
	char		buf[40];
	rt_err_t	ret;
	uint16_t	len;

	T_GSM_STATE oldstate;

	if( sms_state != SMS_IDLE )
	{
		return;
	}
	/*检查是否出于AT命令就绪的状态,可以进行短信操作*/
	if( gsm_state != GSM_TCPIP )
	{
		if( gsm_state != GSM_AT )
		{
			return;
		}
	}
	if( rt_mb_recv( &mb_sms, &i, 0 ) != RT_EOK ) /*收到短信操作*/
	{
		return;
	}
	oldstate	= gsm_state;
	gsm_state	= GSM_AT_SEND;

	if( i < 0xFF )
	{
		sprintf( buf, "AT+CMGR=%d\r\n", i );
		sms_index	= i;
		ret			= gsm_send( buf, RT_NULL, RT_NULL, RESP_TYPE_NONE, RT_TICK_PER_SECOND, 1 );
	}else                                   /*发送信息*/
	{
		sms_send	= (char*)i;
		len			= sms_send[0];          /*tp_len*/
		sprintf( buf, "AT+CMGS=%d\r", len );
		ret = gsm_send( buf, RT_NULL, ">", RESP_TYPE_STR, RT_TICK_PER_SECOND * 5, 1 );
		if( ret == RT_EOK )
		{
			len = strlen( sms_send + 1 );   /*真实消息长度,包括CTRL_Z*/
			m66_write( &dev_gsm, 1, sms_send, len );
			//rt_kprintf("\nSMS>SEND(len=%d):%s",len,sms_send+1);
		}
		//rt_thread_delay(RT_TICK_PER_SECOND/4);
		buf[0]	= 0x1A;
		buf[1]	= 0x0;
		ret		= gsm_send( buf, RT_NULL, "+CMGS:", RESP_TYPE_STR_WITHOK, RT_TICK_PER_SECOND * 20, 1 );
		rt_free( (void*)i );
	}
	gsm_state = oldstate;
}

/***********************************************************
* Function:		gsmrx_cb
* Description:	gsm收到信息的处理
* Input:			char *s     信息
    uint16_t len 长度
* Output:
* Return:
* Others:
***********************************************************/
static void gsmrx_cb( char *pInfo, uint16_t size )
{
	int		i, len = size;
	uint8_t tbl[24] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 0, 0, 0, 0, 0, 0, 0xa, 0xb, 0xc, 0xd, 0xe, 0xf };
	char	c, *pmsg;
	char	*psrc = RT_NULL, *pdst = RT_NULL;
	int32_t infolen, linkno;

/*网络侧的信息，直接通知上层软件*/
	if( fgsm_rawdata_out )
	{
		rt_kprintf( "\n%d gsm<%s", rt_tick_get( ), pInfo );
		fgsm_rawdata_out--;
	}

/*判读并处理*/
	psrc	= pInfo;
	pdst	= pInfo;
	if( strncmp( psrc, "%IPDATA:", 7 ) == 0 )
	{
		/*解析出净信息,编译器会优化掉pdst*/
		i = sscanf( psrc, "%%IPDATA:%d,%d,%s", &linkno, &infolen, pdst );
		if( i != 3 )
		{
			return;
		}
		if( infolen < 11 )
		{
			return;
		}
		if( *pdst != '"' )
		{
			return;
		}
		psrc	= pdst;     /*指向""内容*/
		pmsg	= pdst + 1; /*指向下一个位置*/

		for( i = 0; i < infolen; i++ )
		{
			c		= tbl[*pmsg++ - '0'] << 4;
			c		|= tbl[*pmsg++ - '0'];
			*pdst++ = c;
		}
		gprs_rx( linkno, psrc, infolen );
		return;
	}
/*	00002381 gsm<%IPCLOSE:1*/

	if( strncmp( psrc, "%IPCLOSE:", 9 ) == 0 )
	{
		c = *( psrc + 9 ) - 0x30;
		cb_socket_close( c );
		return;
	}

	if( strncmp( psrc, "%TSIM 0", 7 ) == 0 )    /*没有SIM卡*/
	{
		//pop_msg("SIM卡不存在",RT_TICK_PER_SECOND*1000);
		return;
	}

	if( sms_rx( pInfo, size ) )                 /*一个完整的处理过程?*/
	{
		return;
	}

	/*直接发送到Mailbox中,内部处理*/
	pmsg = rt_malloc( len + 2 );
	if( pmsg != RT_NULL )
	{
		*pmsg			= len >> 8;
		*( pmsg + 1 )	= len;
		memcpy( pmsg + 2, pInfo, len );
		rt_mb_send( &mb_gsmrx, (rt_uint32_t)pmsg );
	}
	return;
}

#define RT_THREAD_ENTRY_GSM

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[512];
struct rt_thread thread_gsm;


/*
   状态转换，同时处理开机、登网、短信、TTS、录音等过程
 */
static void rt_thread_entry_gsm( void* parameter )
{
	while( 1 )
	{
		switch( gsm_state )
		{
			case GSM_POWERON:
				rt_thread_gsm_power_on( RT_NULL );
				break;
			case GSM_POWEROFF:
				GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
				rt_thread_delay( RT_TICK_PER_SECOND * 5 ); /*延时5秒再启动*/
				gsm_state = GSM_IDLE;
				break;
			case  GSM_GPRS:
				rt_thread_gsm_gprs( RT_NULL );
				break;
			case GSM_SOCKET_PROC:
				rt_thread_gsm_socket( RT_NULL );
				break;
			case GSM_IDLE:
				break;
			case GSM_TCPIP:
				break;
			case GSM_AT:
				break;
			case GSM_AT_SEND:
				break;
			case GSM_ERR:
				break;
		}
		sms_proc( );
		tts_proc( );    /*tts处理*/
		at_cmd_proc( ); /*at命令处理*/
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

#define RT_THREAD_ENTRY_GSM_RX

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_rx_stack[1024];
struct rt_thread thread_gsm_rx;


/*
   状态转换，同时处理短信、TTS、录音等过程
 */
static void rt_thread_entry_gsm_rx( void* parameter )
{
	unsigned char ch;
	while( 1 )
	{
		while( uart4_rxbuf_rd != uart4_rxbuf_wr )   /*有数据时，保存数据*/
		{
			ch				= uart4_rxbuf[uart4_rxbuf_rd++];
			uart4_rxbuf_rd	%= UART4_RX_SIZE;
			if( ch > 0x1F )                         /*可见字符才保存*/
			{
				gsm_rx[gsm_rx_wr++] = ch;
				gsm_rx_wr			%= GSM_RX_SIZE;
				gsm_rx[gsm_rx_wr]	= 0;
			}
			if( ch == 0x0d )
			{
				if( gsm_rx_wr )
				{
					gsmrx_cb( (char*)gsm_rx, gsm_rx_wr );           /*接收信息的处理函数*/
				}
				gsm_rx_wr = 0;
			}
		}
		if( rt_tick_get( ) - last_tick > RT_TICK_PER_SECOND / 5 )   //等待200ms,实际上就是变长的延时,最迟100ms处理完一个数据包
		{
			if( gsm_rx_wr )
			{
				gsmrx_cb( (char*)gsm_rx, gsm_rx_wr );               /*接收信息的处理函数*/
				gsm_rx_wr = 0;
			}
		}
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gsm_init( void )
{
	rt_sem_init( &sem_at, "sem_at", 1, RT_IPC_FLAG_FIFO );
	rt_mb_init( &mb_gsmrx, "mb_gsmrx", &mb_gsmrx_pool, MB_GSMRX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );
	rt_mb_init( &mb_tts, "mb_tts", &mb_tts_pool, MB_TTS_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );
	rt_mb_init( &mb_at_tx, "mb_at_tx", &mb_at_tx_pool, MB_AT_TX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );
	rt_mb_init( &mb_sms, "mb_sms_rx", &mb_sms_pool, MB_SMS_RX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );

	rt_thread_init( &thread_gsm,
	                "gsm",
	                rt_thread_entry_gsm,
	                RT_NULL,
	                &thread_gsm_stack[0],
	                sizeof( thread_gsm_stack ), 7, 5 );
	rt_thread_startup( &thread_gsm );

	rt_thread_init( &thread_gsm_rx,
	                "gsm_rx",
	                rt_thread_entry_gsm_rx,
	                RT_NULL,
	                &thread_gsm_rx_stack[0],
	                sizeof( thread_gsm_rx_stack ), 6, 5 );
	rt_thread_startup( &thread_gsm_rx );

	dev_gsm.type	= RT_Device_Class_Char;
	dev_gsm.init	= m66_init;
	dev_gsm.open	= m66_open;
	dev_gsm.close	= m66_close;
	dev_gsm.read	= m66_read;
	dev_gsm.write	= m66_write;
	dev_gsm.control = m66_control;

	rt_device_register( &dev_gsm, "gsm", RT_DEVICE_FLAG_RDWR );
	rt_device_init( &dev_gsm );
}

/************************************** The End Of File **************************************/
